Autodesk.Revit.DB.MEPModel.GetAssignedElectricalSystems
Retrieves the electrical systems this electrical panel currently is assigned to.
Remarks:
This property returns a set of Electrical Systems. If there are no electrical systems created
for this model, this property will be an empty set.
This method supersedes an older AssignedElectricalSystems property which has been deprecated.
Since:
2021

Autodesk.Revit.DB.MEPModel.GetElectricalSystems
Retrieves the electrical systems that are currently created using this MEPModel.
Remarks:
This property returns a set of Electrical Systems. If there are no electrical systems created
for this model, this property will be an empty set.
This method supersedes an older ElectricalSystems property which has been deprecated.
Since:
2021

Autodesk.Revit.DB.MEPModel.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.MEPModel.ConnectorManager
Retrieves the Connector Manager from this MEPModel.

Autodesk.Revit.DB.MEPModel.#ctor(Autodesk.Revit.DB.FamilyInstance)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.MEPModel
Supports all MEP models that are persistent within the Autodesk Revit project.